Revit 2026 API

# OutlineScale Method

---

Scales the bounding box by given scale.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Scale(
	double scale
)
```
```vb
Public Sub Scale (
	scale As Double
)
```
```cpp
public:
void Scale(
	double scale
)
```
```fsharp
member Scale :
        scale : float -> unit
```

#### Parameters

scale Double
     The scale value. It should be greater than zero.

| Exception | Condition |
| --- | --- |
| ArgumentException | The scale is invalid. |

#### Reference

Outline Class

Autodesk.Revit.DB Namespace